Projects/Keyboard/InfProjectKeyboard/InitProposal/just_description.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-01 Mon 20:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Nathan Sharp" />
</head>
<body>
<div id="content">

<div id="outline-container-orgca07c39" class="outline-2">
<h2 id="orgca07c39"><span class="section-number-2">1</span> Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
This project will  design a fast input device for the present (mobile) and forthcoming (XR) age of human-computer interaction, primarily looking to build a viable alternative typewriter-style keyboard. Specifically, looking to design, build and develop software around a <b>portable handheld chorded input device</b> (keyboard) and a starting point for the future of input.
</p>
</div>
</div>

<div id="outline-container-orgd654949" class="outline-2">
<h2 id="orgd654949"><span class="section-number-2">2</span> Why? Bandwidth: The master variable</h2>
<div class="outline-text-2" id="text-2">
<p>
Where does the human end and the computer begin? The answer appears to be that it doesn&rsquo;t (<a href="https://en.wikipedia.org/wiki/Extended_mind_thesis">https://en.wikipedia.org/wiki/Extended_mind_thesis</a>).  We become ever more entwined with our technology; one day it becomes inseparable and indistinguishable from us.  Many argue this is already so. Perhaps then a better question is <i>how</i> this merger happens?
</p>

<p>
Neurotechnology company Neuralink (<a href="https://neuralink.com">https://neuralink.com</a>) is a frontrunner, building ambitious, implantable brain-machine interfaces to reach this goal. They can often be heard framing their fundamental mission in terms of &ldquo;bandwidth,&rdquo; proposing that the current input/output channels between human and computer are relatively slow and limited, and a scale factor increase is the key to advancing human-computer symbiosis.
</p>

<p>
I, too, believe that bandwidth is the master variable. Consider what would happen if you were able navigate a computer with comparable speed, ease and conceptual abstraction to your internal thoughts. Hence, for this project I have chosen to target <b>human-computer bandwidth</b>.
</p>

<blockquote>
<p>
Goal 1: Increase human-computer bandwidth by a scale factor.
</p>
</blockquote>

<blockquote>
<p>
Goal 1.1:  Research and develop a more robust and quantifiable concept of human-computer bandwidth.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orga6ee376" class="outline-2">
<h2 id="orga6ee376"><span class="section-number-2">3</span> What? A bandwidth bottleneck: typewriter keyboards</h2>
<div class="outline-text-2" id="text-3">
<p>
Analysis of the current human-computer input/output landscape led me to identifying the (<i>typewriter) keyboard</i> as a bandwidth bottleneck for the following reasons:
</p>

<ol class="org-ol">
<li><i>Input is a bigger bottleneck than output</i>. LCD displays and VR headsets can produce more visual stimulus than you can process, immersing the totality of your senses.</li>
<li>Since the typewriter&rsquo;s conception (~1710), <i>the design hasn&rsquo;t changed much in its evolution to modern standard keyboard.</i> It might be possible to capitalise on design decisions made for contingent reasons which are antithetical to modern design needs.</li>
<li><i>Keyboards are obviously un-ergonomic</i> with respect to the hands that operate them
<ul class="org-ul">
<li>The 2D grid layout is not natural for hand movements</li>
<li>Keyboards cannot be easily operated without looking</li>
</ul></li>
<li><i>Keyboards are hard to learn.</i> Despite speeds of 100+wpm being possible, the average American only manages 30wpm.</li>
<li>Keyboards are <i>not naturally suited to mobile useage</i>. (their mobile touchscreen variants are even slower and less ergonomic)</li>
<li>Keyboards are <i>not suitable for VR/AR</i>, which many think is the future (<a href="https://www.macrumors.com/roundup/apple-glasses/">https://www.macrumors.com/roundup/apple-glasses/</a>, <a href="https://tech.fb.com/ar-vr/">https://tech.fb.com/ar-vr/</a>)
<ul class="org-ul">
<li>there is currently <b>no known solution for mobile text input in VR</b> (beyond point and click on a virtual keyboard).</li>
</ul></li>
<li><i>Keyboards and mice cannot be used simultaneously.</i> This is a massive bandwidth bottleneck.</li>
<li>Keyboards (commands) are more <i>conceptually complex</i> than mice (point and inspect), making more <i>room for improvement</i> (although if possible building functionality for both would be ideal).</li>
</ol>

<p>
Developing <b>portable wireless handheld ergonomic input device</b> potentially solves all of these probelms. Beyond a minimum working product I will focusing on design decisions that <i>increase bandwidth</i> (faster input, higher level abstraction,  power user features). I will be using typing-speed in wpm as good approximation for the success of this project.
</p>

<blockquote>
<p>
<i>Goal 0:</i>  <b>Build an portable handheld input device (keyboard) capable of 300wpm for a normal user</b>
</p>
</blockquote>

<p>
I don&rsquo;t have a good bound on how unrealistic this goal is. I took the idea vaguely from Peter Theil who say that for an innovation to matter it has to be 10x better than the alternative. 30wpm (the average) x 10 = 300wpm.
</p>
</div>
</div>

<div id="outline-container-orgd43159c" class="outline-2">
<h2 id="orgd43159c"><span class="section-number-2">4</span> How? Academic scope and technical aspects of the project</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org393ab89" class="outline-3">
<h3 id="org393ab89"><span class="section-number-3">4.1</span> Physical &amp; electrical design</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The physical design will include designing a casing (CAD),  printing it and sourcing key switches. The electrical design will consist of selecting and fitting an appropriate microcontroller and soldering the design together.
</p>
</div>
</div>
<div id="outline-container-org0f13ca3" class="outline-3">
<h3 id="org0f13ca3"><span class="section-number-3">4.2</span> Keymap design</h3>
<div class="outline-text-3" id="text-4-2">
<p>
This will be the main theoretical area of the project. Fundamentally there will be some mapping between key-switch-presses and output actions (print letter, backspace, function call, etc. )
</p>

<p>
An in depth review of theory and implementations of keymaps will be conducted in the service of designing a better one. It&rsquo;s hard to know what will be most relevent at this stage, so I intend to research concepts such as chorded keyboards, signal compression and linguistic symbol systems.
</p>

<p>
Similarly, possibilities to extend (and reduce) the classical keymap will be considered. Is the current human-computer input paradigm optimal? Is there functionality that could be moved into (or out of) the input device, unifying commands across interfaces. For example, how are unicode characters entered? Could mouse/gesture input be unified?
</p>

<blockquote>
<p>
<i>Goal 2:</i> Research the emergent language of human computer interaction. What are the fundamental operations? How can we build this into a universal input device.
</p>
</blockquote>

<p>
This logic with then have to be programmed into the keyboard in a way that is well documented and extensible to others who wish to use the product.
</p>
</div>
</div>
<div id="outline-container-org9d4e558" class="outline-3">
<h3 id="org9d4e558"><span class="section-number-3">4.3</span> Software</h3>
<div class="outline-text-3" id="text-4-3">
<p>
All further features will be software related. This will could include things such as an inbuilt abbreviations dictionary, beginners tutorial, autosuggestions, a standalone UI, etc. I suspect the majority of the innovations needed to increase bandwidth will come from software.
</p>
</div>
</div>
</div>

<div id="outline-container-org0c27977" class="outline-2">
<h2 id="org0c27977"><span class="section-number-2">5</span> Support Needed</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <b>Software</b>: General guidance on creating software for other users to interact with</li>
<li class="off"><code>[&#xa0;]</code> <b>Keymap Design</b>: this is quite a unique task that the guidance of an expert would be invaluable</li>
<li class="off"><code>[&#xa0;]</code> <b>Physical Buttons:</b> help choosing/finding/designing the right physical switches/buttons/etc.</li>
</ul>
</div>
</div>

<div id="outline-container-orgdfd658d" class="outline-2">
<h2 id="orgdfd658d"><span class="section-number-2">6</span> Notes</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>references were left out because I felt hyperlinks were more informative under the formatting circumstances</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Nathan Sharp</p>
<p class="date">Created: 2021-03-01 Mon 20:29</p>
</div>
</body>
</html>
